The columns contains the closing price of 4 market indexes. 
Each market indexes is a portfolio of most traded public companies on the respective stock exchange.

S&P 500 - spx (USA)

DAX 30 - dax (Germany)

FTSE 100 - ftse (UK)

NIKKEI 225 - nikkei (Japan)

Each market indexes contains the number of companies in the portfolio of the respective stock exchange. for e.g. S&P contains 500 companies and so on.

### Import the Packages

In [1]:
import pandas as pd
import numpy as np

### Importing the Data

In [2]:
raw_csv_data = pd.read_csv('data/Index2018.csv')

In [3]:
df_comp = raw_csv_data.copy()

### Examining the Data

In [4]:
df_comp.head()

         date     spx      dax     ftse    nikkei
0  07/01/1994  469.90  2224.95  3445.98  18124.01
1  10/01/1994  475.27  2225.00  3440.58  18443.44
2  11/01/1994  474.13  2228.10  3413.77  18485.25
3  12/01/1994  474.17  2182.06  3372.02  18793.88
4  13/01/1994  472.47  2142.37  3360.01  18577.26

In [5]:
df_comp.describe()

               spx           dax         ftse        nikkei
count  6269.000000   6269.000000  6269.000000   6269.000000
mean   1288.127542   6080.063363  5422.713545  14597.055700
std     487.586473   2754.361032  1145.572428   4043.122953
min     438.920000   1911.700000  2876.600000   7054.980000
25%     990.671905   4069.350000  4486.100000  10709.290000
50%    1233.420000   5773.340000  5662.430000  15028.170000
75%    1459.987747   7443.070000  6304.250000  17860.470000
max    2872.867839  13559.600000  7778.637689  24124.150000

### Length of Time Period

In [6]:
df_comp.date.describe() # Top value is arbitary

count           6269
unique          6269
top       21/03/2012
freq               1
Name: date, dtype: object

### From Text to Date

In [7]:
df_comp.date = pd.to_datetime(df_comp.date, dayfirst=True)

In [8]:
df_comp.head()

        date     spx      dax     ftse    nikkei
0 1994-01-07  469.90  2224.95  3445.98  18124.01
1 1994-01-10  475.27  2225.00  3440.58  18443.44
2 1994-01-11  474.13  2228.10  3413.77  18485.25
3 1994-01-12  474.17  2182.06  3372.02  18793.88
4 1994-01-13  472.47  2142.37  3360.01  18577.26

In [9]:
df_comp.date.describe()

count                    6269
unique                   6269
top       1999-08-23 00:00:00
freq                        1
first     1994-01-07 00:00:00
last      2018-01-29 00:00:00
Name: date, dtype: object

### Setting the Index

In [10]:
df_comp.set_index("date", inplace=True)

In [11]:
df_comp.head()

               spx      dax     ftse    nikkei
date
1994-01-07  469.90  2224.95  3445.98  18124.01
1994-01-10  475.27  2225.00  3440.58  18443.44
1994-01-11  474.13  2228.10  3413.77  18485.25
1994-01-12  474.17  2182.06  3372.02  18793.88
1994-01-13  472.47  2142.37  3360.01  18577.26

In [12]:
df_comp.date.describe()

AttributeError: 'DataFrame' object has no attribute 'date'

### Setting the Desired Frequency

In [13]:
df_comp = df_comp.asfreq('b')

In [14]:
df_comp.head()

               spx      dax     ftse    nikkei
date
1994-01-07  469.90  2224.95  3445.98  18124.01
1994-01-10  475.27  2225.00  3440.58  18443.44
1994-01-11  474.13  2228.10  3413.77  18485.25
1994-01-12  474.17  2182.06  3372.02  18793.88
1994-01-13  472.47  2142.37  3360.01  18577.26

### Handling Missing Values

In [15]:
df_comp.isna().sum()

spx       8
dax       8
ftse      8
nikkei    8
dtype: int64

In [16]:
df_comp.spx.fillna(method="ffill", inplace=True)

In [17]:
df_comp.isna().sum()

spx       0
dax       8
ftse      8
nikkei    8
dtype: int64

In [18]:
df_comp.ftse.fillna(method='bfill', inplace=True)

In [19]:
df_comp.isna().sum()

spx       0
dax       8
ftse      0
nikkei    8
dtype: int64

In [20]:
df_comp.dax.fillna(value=df_comp.dax.mean(), inplace=True)

In [21]:
df_comp.isna().sum()

spx       0
dax       0
ftse      0
nikkei    8
dtype: int64

In [23]:
df_comp.shape

(6277, 4)

### Simplifying the Dataset

In [31]:
df_comp['market_value'] = df_comp.spx

In [32]:
df_comp.describe()

               spx           dax         ftse        nikkei  market_value
count  6277.000000   6277.000000  6277.000000   6269.000000   6277.000000
mean   1288.642547   6080.063363  5423.690398  14597.055700   1288.642547
std     487.868210   2752.604984  1145.568370   4043.122953    487.868210
min     438.920000   1911.700000  2876.600000   7054.980000    438.920000
25%     992.715221   4070.460000  4487.880000  10709.290000    992.715221
50%    1233.761241   5774.380000  5663.300000  15028.170000   1233.761241
75%    1460.250000   7442.660000  6304.630175  17860.470000   1460.250000
max    2872.867839  13559.600000  7778.637689  24124.150000   2872.867839

In [33]:
del df_comp['spx']

In [34]:
df_comp.describe()

                dax         ftse        nikkei  market_value
count   6277.000000  6277.000000   6269.000000   6277.000000
mean    6080.063363  5423.690398  14597.055700   1288.642547
std     2752.604984  1145.568370   4043.122953    487.868210
min     1911.700000  2876.600000   7054.980000    438.920000
25%     4070.460000  4487.880000  10709.290000    992.715221
50%     5774.380000  5663.300000  15028.170000   1233.761241
75%     7442.660000  6304.630175  17860.470000   1460.250000
max    13559.600000  7778.637689  24124.150000   2872.867839

In [38]:
del df_comp['dax'], df_comp['ftse'], df_comp['nikkei']

In [39]:
df_comp.describe()

       market_value
count   6277.000000
mean    1288.642547
std      487.868210
min      438.920000
25%      992.715221
50%     1233.761241
75%     1460.250000
max     2872.867839

### Splitting the Data

In [42]:
size = int(len(df_comp)*0.8)

In [44]:
df = df_comp.iloc[:size]
df_test = df_comp.iloc[size:]

In [45]:
df.tail()

            market_value
date
2013-04-01   1562.173837
2013-04-02   1570.252238
2013-04-03   1553.686978
2013-04-04   1559.979316
2013-04-05   1553.278930

In [46]:
df_test.head()

            market_value
date
2013-04-08   1563.071269
2013-04-09   1568.607909
2013-04-10   1587.731827
2013-04-11   1593.369863
2013-04-12   1588.854623